; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-5-0)
(:domain BLOCKS)
(:objects A B C D E - block)
(:INIT (ON A E) (CLEAR A) (ONTABLE E) (ON C B) (ON B D) (CLEAR C) (ONTABLE D) (HANDEMPTY) )
 (:goal (AND (ON A B) (ON D C) (ON C E) ))
)

; plan
1. (unstack a e)
   deleted: (clear a) (handempty) (on a e)
   added: (holding a) (clear e)
   goals met: 0 of 3
2. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 0 of 3
3. (unstack c b)
   deleted: (clear c) (handempty) (on c b)
   added: (holding c) (clear b)
   goals met: 0 of 3
4. (stack c e)
   deleted: (holding c) (clear e)
   added: (clear c) (handempty) (on c e)
   goals met: 1 of 3
5. (unstack b d)
   deleted: (clear b) (handempty) (on b d)
   added: (holding b) (clear d)
   goals met: 1 of 3
6. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 1 of 3
7. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 1 of 3
8. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 2 of 3
9. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 2 of 3
10. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (handempty) (on d c)
   goals met: 3 of 3
